In [14]:
import pandas as pd
import numpy as np

# Data Profiling

In [15]:
# Import libraries
# Load sample dataset (sample_data.csv)

df = pd.read_csv('sample.csv')

df

     customer_id   age gender  purchase_amount signup_date
0              1  25.0      M           100.50  2023-01-15
1              2   NaN      F             0.00  2023-02-01
2              3  30.0    NaN           200.75         NaN
3              4  45.0  Other           150.25  2023-03-10
4              5  -5.0      m              NaN  2023/01/15
..           ...   ...    ...              ...         ...
105          103  27.0  Other              NaN  2025-04-05
106          104  50.0      M           200.75  2025-05-01
107          105  19.0      F            50.25  2025-06-10
108          106  40.0      M           150.00  2025-07-15
109          107   NaN      F            80.75  2025-08-01

[110 rows x 5 columns]

In [73]:
## get the data type of columsn

data = df.info()

data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      110 non-null    int64
 1   age              99 non-null     float64
 2   gender           106 non-null    object
 3   purchase_amount  96 non-null     float64
 4   signup_date      106 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 4.4+ KB

In [12]:
# Total Row Count
# Calculate here

print ('Total Columns ',len(df.columns))
print ('Total Rows ',len(df.values))

Total Columns  5
Total values  110

In [23]:
# Null Value Count
# Calculate for each column

for i in df.columns:
    print(i)
    print('Values count : ', df[i].count())
    print('Null values : ', df[i].isnull().sum())

customer_id
Values count :  110
Null values :  0
age
Values count :  99
Null values :  11
gender
Values count :  106
Null values :  4
purchase_amount
Values count :  96
Null values :  14
signup_date
Values count :  106
Null values :  4

In [45]:
# Distinct Values
# Calculate for each column

for i in df.columns:
    print('Row Count : ',df[i].count())
    print('Unique values count : ',df[i].nunique())
    print('Unique Values :',df[i].unique())

Row Count :  110
Unique values count :  107
[  1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18
  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36
  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53  54
  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71  72
  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89  90
  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107]
Row Count :  99
Unique values count :  23
[ 25.  nan  30.  45.  -5.  28.  35.  22.  60.  18.  40.  29.  33.  27.
  50.  19.  32. 150.  26.  34.  38.  42.  31.  36.]
Row Count :  106
Unique values count :  4
['M' 'F' nan 'Other' 'm']
Row Count :  96
Unique values count :  27
[100.5    0.   200.75 150.25    nan 300.    75.8   50.   120.3  500.
  25.5   80.75 200.   150.   300.25  60.   100.   250.5  999.99  80.5
 120.75  50.25  75.   200.5  250.75 120.    80.25 120.5 ]
Row Count :  106
Unique values count :  47
['2023-01-15' '2023-02-01' nan '2023-03-10' '2023/01/15' '2023-01-20'
 '2023-04-05' '2023-05-12' '2023-06-01' '2023-07-15' '2023-08-20'
 '2023-09-10' '2023-10-05' '2023-11-01' '2023-12-15' '2024-01-10'
 '2024-02-20' '2024-03-15' '2024-04-01' '2024-05-10' '2024-06-05'
 '2024-07-01' '2024-08-15' '2024-09-10' '2024-10-01' '2024-11-05'
 '2024-12-20' '2025-01-15' '2025-02-01' '2025-03-10' '2025-04-05'
 '2025-05-01' '2025-06-10' '2025-07-15' '2025-08-01' '2025-09-10'
 '2025-10-05' '2025-11-01' '2025-12-15' '2023-02-15' '2023-05-01'
 '2023-06-10' '2023-08-01' '2024-10-05' '2024-11-01' '2024-12-15'
 '2025-01-20' '2025-02-15']

In [47]:
## to find the duplicate values in each columns

for i in df.columns:
    print('Columns' , i)
    print('Duplicate Values : ',df[i].duplicated().sum())
    print(df[i].value_counts()[df[i].value_counts() > 1])

Columns customer_id
Duplicate Values :  3
customer_id
1     2
10    2
50    2
Name: count, dtype: int64
Columns age
Duplicate Values :  86
age
45.0    9
28.0    9
29.0    8
27.0    6
33.0    5
22.0    5
25.0    5
50.0    5
19.0    5
40.0    5
35.0    4
31.0    4
42.0    4
26.0    4
32.0    4
36.0    4
38.0    4
34.0    4
Name: count, dtype: int64
Columns gender
Duplicate Values :  105
gender
F        42
M        40
Other    22
m         2
Name: count, dtype: int64
Columns purchase_amount
Duplicate Values :  82
purchase_amount
0.00      9
150.00    8
100.50    7
300.00    6
200.75    6
80.75     5
50.00     5
120.30    4
300.25    4
200.00    4
150.25    4
80.50     4
50.25     4
100.00    4
250.75    3
120.00    3
80.25     2
60.00     2
200.50    2
120.50    2
75.00     2
Name: count, dtype: int64
Columns signup_date
Duplicate Values :  62
signup_date
2023-03-10    3
2023-04-05    3
2023-01-20    3
2023-10-05    3
2023-11-01    3
2023-09-10    3
2023-07-15    3
2023-12-15    3
2024-01-10    3
2024-07-01    3
2024-06-05    3
2024-05-10    3
2024-04-01    3
2024-03-15    3
2024-02-20    3
2025-04-05    3
2025-05-01    3
2025-03-10    3
2025-06-10    3
2025-07-15    3
2025-08-01    3
2024-08-15    3
2024-09-10    3
2025-02-01    2
2024-11-05    2
2024-12-20    2
2025-09-10    2
2025-10-05    2
2025-11-01    2
2025-01-15    2
2024-10-01    2
2023-05-01    2
2023-06-10    2
2023-08-01    2
2023-02-15    2
2025-12-15    2
Name: count, dtype: int64

In [58]:

# Min/Max/Avg/StdDev
# Calculate for numerical columns


stats_age =  {
   "avg age" :  df['age'].mean().__round__(),
   "median age" :  df['age'].median().__round__(),
   "Max age" :  df['age'].max().__round__(),
   "Min age" :  df['age'].min().__round__()
}

print(stats_age)

stats_purchase_amount =  {
   "avg purchase_amount " :  df['purchase_amount'].mean().__round__(),
   "median purchase_amount" :  df['purchase_amount'].median().__round__(),
   "Max purchase_amount" :  df['purchase_amount'].max().__round__(),
   "Min purchase_amount" :  df['purchase_amount'].min().__round__()
}

print(stats_purchase_amount)


##df['purchase_amount']

# Save Results
# Export to CSV or JSON

{'avg age': 34, 'median age': 32, 'Max age': 150, 'Min age': -5}
{'avg purchase_amount ': 143, 'median purchase_amount': 120, 'Max purchase_amount': 1000, 'Min purchase_amount': 0}

In [61]:
# Frequency Distribution
# Calculate for categorical columns

age_dist = df.groupby(by=['age']).count()

age_dist

        customer_id  gender  purchase_amount  signup_date
age
-5.0              1       1                0            1
 18.0             1       1                1            1
 19.0             5       5                4            5
 22.0             5       5                5            5
 25.0             5       4                4            5
 26.0             4       4                4            4
 27.0             6       6                5            6
 28.0             9       9                9            9
 29.0             8       8                7            8
 30.0             1       0                1            0
 31.0             4       4                3            4
 32.0             4       4                2            4
 33.0             5       5                4            5
 34.0             4       4                3            3
 35.0             4       4                4            4
 36.0             4       4                3            4
 38.0             4       4                4            4
 40.0             5       4                4            5
 42.0             4       4                4            4
 45.0             9       8                8            9
 50.0             5       5                4            5
 60.0             1       1                1            0
 150.0            1       1                1            1

In [62]:
gender_dist = df.groupby(by=['gender']).count()

gender_dist

        customer_id  age  purchase_amount  signup_date
gender
F                42   36               38           41
M                40   37               36           38
Other            22   20               17           22
m                 2    2                1            2

# Data Cleaning

In [12]:
## detect extra spaces

l1= 'kema  '
l2= '  lona'
l3='  don  '
l4='gyui'

if l1 != l1.strip():
    print('extra space')

if l2 != l2.strip():
    print('L2 extra space')

if l3 != l3.strip():
    print('L3 extra space')

if l4 != l4.strip():
    print('L4 extra space')

extra space
L2 extra space
L3 extra space

In [ ]:
## DETECT EXTRA SAPCES IN BETWEEN

In [6]:
## trimsapce

var= "   sharma gauri   "
print(var)

print("Left triml: " + var.lstrip() + '\n'  + "right trim: " + var.rstrip())

print('trim troil: ' + var.strip())

   sharma gauri
Left triml: sharma gauri
right trim:    sharma gauri
trim troil: sharma gauri

In [13]:
# case normalization

c1 = 'DANGER'
c2 = 'not danger'

print('LOWER' , str(c1).lower())
print('UPPER' , str(c2).upper())

LOWER danger
UPPER NOT DANGER

In [35]:
## NULL VALUES

#detect null values
avg_age =  df['age'].mean().__floor__()
avg_purc =  df['age'].mean().__floor__()
avg

33